[
  {
    "title": "Etomology Of Glen Ellyn",
    "date": "unknown",
    "type": "narrative",
    "source": "etymology/etomology_of_glen_ellyn.md",
    "content": "# How many names has Glen Ellyn had?\nThe most common answer is seven, although there is some disagreement about what the seven names should be. Here is the chronology of what we know.\n\n1834: Babcock’s Grove — When the first settlers arrived here, this area is actually described not as a town but as a large tract of land staked out by the Babcock brothers in 1833 (which included much of what today is Lombard).\n1835: Fish’s Corners — Named for Daniel Fish who had a cabin near where three trails converged. Today, the trails are known as St. Charles Road, Geneva Road and Main Street. The little community was also called DuPage Center because of its location at the center of DuPage County.\n1846: Stacy’s Corners — This name came into common usage when Moses and Joann Stacy built a popular stagecoach inn at the intersection where St. Charles Road meets Geneva Road and North Main Street.\n1850: Newton Station — This was the initial name for a new community that grew up a mile south of Stacy’s Corners after the railroad came through that area — what is today downtown Glen Ellyn.\n1851: Danby — Newton Station was renamed Danby by the new postmaster who had come from Danby, Vermont when he learned that there was another town in Illinois named Newton Station.\n1874: Prospect Park — Danby’s name was changed to Prospect Park because the Village fathers thought it would improve the image of the town. (Danby had quite the reputation at that time.) Stacy’s Corners and Prospect Park both grew and gradually merged.\n1894: Glen Ellyn — The town adopted this name after Lake Glen Ellyn was built by Thomas E. Hill and the town became a resort community. “Ellyn” is the Welsh spelling of Ellen, the name of Hill’s wife."
  },
  {
    "title": "Mercy Dodge Churchill Bio",
    "date": "unknown",
    "type": "biography",
    "source": "bio/mercy_dodge_churchill_bio.md",
    "content": "# Churchill, Mercy Dodge\nNW Corner of St. Charles & Swift, Glen Ellyn, IL 60137\nKin: Winslow Churchill (Husband)\nAccomplishments: Mother to 9, 5 sons and 4 daughters.\nBio:\nMercy Dodge Churchill came here with her husband, Winslow, when she was 60 years old. With her were her five sons, four daughters and their spouses. Also thirteen grandchildren, one of whom had been born during their journey from upstate New York. She lived here until 1863 when she died at the age of 89. The Babcock brothers, Ralph, Anson, and Morgan, took up claims to a large wooded area in 1833. The following year, Deacon Winslow Churchill and his family of twenty-eight members arrived from New York. They held their claim until it was surveyed in 1840 and then paid $1.25 per acre."
  },
  {
    "title": "Thomas Hill Bio",
    "date": "unknown",
    "type": "biography",
    "source": "bio/thomas_hill_bio.md",
    "content": "# Hill, Thomas E.\n1832-1915\n123 Main Street, Glen Ellyn, IL 60137\nKin: Ellen Whitcomb (second wife)\nAccomplishments: Village of Glen Ellyn President (1885 to 1889) teacher, newspaper publisher, public servant, two term mayor of Aurora, author of Hill’s Manual of Social and Business Forms.\nBio:\nBefore arriving here in 1885, Professor Thomas E. Hill had been a teacher, a newspaper publisher and a public servant, having served two terms as mayor of Aurora. He also was the author of Hill’s Manual of Social and Business Forms, regarded by many as the pre-eminent etiquette book of the age. He and his wife, Ellen, brought a new level of sophistication to our town. Both their dress and their manner were refined and they inspired others to follow their lead. Shortly after his arrival, Hill succeeded Joseph R. McChesney as Village President, serving from 1885 to 1889. Hill also was a visionary and saw how the village, with its attractive rolling terrain and situated as it was on a train line just 25 miles west of Chicago, could become a magnet for folks who wanted to escape the clamor of the big city. To complete the attraction, Hill and several local partners purchased much of the acreage northeast of the downtown area. They dammed a creek to create a beautiful 50-acre lake which Hill called Lake Glen Ellyn (“Ellyn” being the Welsh spelling of his wife’s name), built a 100-room hotel on the hill overlooking the lake, and constructed a nearby pavilion where five different natural springs purportedly offered healing powers. The development of this subdivision coincided with, and arguably encouraged, the building of many of the grand Victorian style homes that also helped the Village overcome its shoddy image. Recognizing the contribution that Thomas E. Hill and his wife had made, and possibly to capitalize on the appeal Lake Glen Ellyn brought to the community, the town fathers decided in 1891 to change the name of the village to Glen Ellyn. Without a doubt, there are multiple candidates for the accolade of best leader in the history of Glen Ellyn. But Thomas E. Hill would have to be toward the top of the list."
  },
  {
    "title": "Lawrence Cooper Bio",
    "date": "unknown",
    "type": "biography",
    "source": "bio/lawrence_cooper_bio.md",
    "content": "# Cooper, Lawrence C.\nEast side of Park Blvd just north of Anthony St, Glen Ellyn, IL 60137\nKin: Married Emma Yalding in 1871, had three children\nAccomplishments: Village Attorney, Village and County Board Member, paid for for “S curve” as he thought that a curve was more interesting and graceful than the straight lines of most streets, introduced the game of baseball to Glen Ellyn.\nBio:\nMention the “S curve” to anyone who has lived in Glen Ellyn and they know immediately that you’re referring to that section of Park Boulevard just north of the railroad tracks. Few know, however, that this peculiar twist in the road was very deliberate and it was one of many contributions to the Village made by Lawrence C. Cooper. The Cooper family moved to this area from Clinton County, New York, in 1852 when Lawrence was five years old. They traveled the Great Lakes by steamer to Chicago, and from there by train to the town then called Danby. Cooper attended school in Danby before getting a law degree from the University of Michigan in Ann Arbor. Before moving back to Danby, he practiced law in Chicago and lived briefly in a room on Chicago’s north side. Shortly before his marriage to Emma Yalding (daughter of Jonathon Yalding, deacon of the First Congregational Church) all of his possessions, including his wedding clothes, were destroyed in the great Chicago fire of 1871. The wedding took place anyway. Soon after his marriage, Cooper moved back to Danby, joined the legal staff of the Chicago and North Western Railroad, and became one of the early commuters to Chicago using the train. Although he held this post in Chicago for some 50 years, his real contributions were to the community where he lived. These included working with Thomas E. Hill in 1889 to form the company that created Lake Ellyn. Starting in 1902 he served as village attorney for several years, and at various times served on both the village and county boards. But before any of those involvements Mr. L.C. Cooper introduced the game of baseball to Glen Ellyn, having learned the game while at the University of Michigan. He and a friend organized a team called the Rustics. Shortly after that, Cooper succeeded in luring the Excelsiors of Chicago (the club which later became the Chicago Cubs) to come here and play a game. Not surprisingly, given that only two members of the Rustics had played baseball previously, it did not go well for the Rustics. They lost by a score of 102 to 2. In 1893, Cooper and his wife built an expansive home on the east side of Park Boulevard just north of Anthony Street. In those days, the south end of Park Boulevard stopped at Anthony because of a creek that ran through town just south of that point. In 1914 the village trustees passed an ordinance to channel the creek into a storm sewer and to extend Park Boulevard another block south to Pennsylvania Avenue. At his own expense, Cooper paid to incorporate the “S curve” into that road project because he thought that a curve was more interesting and graceful than the straight lines of most streets. Shortly before he died in 1923, at the age of 76, Cooper published his memoirs, Reminiscences of Old Glen Ellyn, a valuable addition to the history of Glen Ellyn. – Moved to Glen Ellyn (then Danby) from New York in 1852, when he was five years old. As a young teenager, Lawrence Cooper read the dispatches on the Civil War to folks gathered in front of the Mansion House in downtown Danby. Later he attended the University of Michigan where he received a law degree … and learned the new game of baseball, which he brought back to Danby. Cooper started practicing law in Chicago, living in a room on Chicago’s north side. Just before his marriage to Danby native Emma Yalding, the great Chicago fire of 1871 burned his apartment building and his wedding clothes. Shortly after the wedding, he and Emma took up residence in Danby and he was hired as an attorney for the Chicago and Northwestern Railroad, a position he held for some 50 years. He became one of the earliest commuters from Danby into Chicago. Although he held this post in Chicago for some 50 years, his real contributions were to the community where he lived. These included working with Thomas E. Hill in 1889 to form the company that created Lake Ellyn and developed the property around it. Starting in 1902 he served as village attorney for several years, and at various times served on both the village and county boards. He also published his memoirs shortly before he died, providing great insight into what Glen Ellyn was like up to the 1920s. In 1893 he and his wife built a home on the east side of Park Boulevard just north of Anthony where he lived until his death. Today, this home has been beautifully restored and has been plaqued by the Historical Society. At the time the home was built, Park Boulevard stopped at Anthony. When the Village decided in 1914 to extend Park down the hill south to Pennsylvania, Cooper thought that an “S” curve would be esthetically preferable, so he paid the Village for the extra cost of doing that."
  },
  {
    "title": "Winslow Churchill Bio",
    "date": "unknown",
    "type": "biography",
    "source": "bio/winslow_churchill_bio.md",
    "content": "# Churchill, Winslow\nNW corner of St. Charles & Swift, Glen Ellyn, IL 60137\nKin: Mercy Dodge Churchill (Wife)\nAccomplishments: 1834 Deacon Churchill built the first log cabin.\nBio:\nWinslow Churchill was the patriarch of the Churchills, the first family to settle here. He was 64 years old when he and 27 others in his family, spanning three generations, left their homes in upstate New York to move to the frontier. Back east he was a stone mason and farmer by trade. He had sold part of his farm for the construction of the Erie Canal and joined with several of his sons to run a canal boat before moving here. He and his sons built five cabins and staked out five farms. Winslow Churchill’s cabin was on the northwest corner of what today is St. Charles Road and Swift Avenue. (A large boulder with a plaque marks the site.) He was a Methodist who conducted the earliest religious meetings and was referred to as Deacon Churchill. Winslow Churchill died here in 1847 at the age of 77 and is buried in the Forest Hills Cemetery."
  },
  {
    "title": "Erastus Ketchum Bio",
    "date": "unknown",
    "type": "biography",
    "source": "bio/erastus_ketchum_bio.md",
    "content": "# 1826-1905\n# Ketchum Jr., Erastus\nKin: Christiana Churchill Ketchum (Mother), Mary Jane Churchill (Wife)\nBio:\nHello, My name is Erastus Ketchum. I came to this area in 1834 at the age of eight, as a member of the first family to settle here. My mother was Christiana Churchill Ketchum, one of the four daughters and five sons of Winslow and Mercy Dodge Churchill. My father died before the family left upstate New York. I was one of the 13 grandchildren who made the trek to homestead this area that soon was to become known as Stacy’s Corners. So, I guess I was one of Glen Ellyn’s original citizens. In the 71 years that I lived here I became known as a carpenter, trapper, gun lover and choir boy. My nickname was “Old Ketch.” When I was 23, I married my cousin, Mary Jane Churchill. There weren’t a lot of options in those days when Stacy’s Corners was so sparsely populated. But we hit it off pretty well, I guess, given that we were happily married for more than 50 years. We lived in a house that I built at the southeast corner of St. Charles Road and Main Street. Later in life I was known as a farmer and carpenter, but I always considered that my greatest exploits were in hunting and trapping. I became good friends with the few remaining Native Americans in this area. So good, in fact, that they once saved my life. I also maintained a cider mill in one of my outbuildings, where I would make cider for farmers who brought wagonloads of apples every fall. I’m proud to say that I also was one of the founders of the Free Methodist Church in town, a church that actively supported the abolitionist movement in the days before the Civil War. I sang in the church choir and was told that I had a beautiful tenor voice. Sadly, my wife passed away about seven years before I did. I continued to live in our home at Stacy’s Corners until 1905 where I died at the age of 79."
  },
  {
    "title": "Baker Sets Village A Blaze In Great Fire Of 1891 Story",
    "date": "unknown",
    "type": "story",
    "source": "story/Baker_Sets_Village_A_Blaze_in_Great_Fire_of_1891_story.md",
    "content": "Baker Sets Village A Blaze in Great Fire of 1891\nThe summer of 1891 in Glen Ellyn was especially hot and dry. The drought persisted into the autumn. Old timers likened it to the weather 20 years earlier that had preceded the Great Chicago Fire of 1871, which burned for two days and consumed everything in a path nearly a mile wide and four miles long.\n\nJohn Elick, a local baker, had the job of lighting the kerosene street lamps along Main Street in Glen Ellyn. On the evening of November 6, 1891, as Elick lit the lamp in front of his bakery, it slipped from his grasp and crashed in flames on the wooden sidewalk. Within seconds, the blaze was beyond what could be smothered with overcoats or a nearby bucket of water, and it quickly spread to Elick’s own building, a wood-frame storefront.\n\nA general alarm was sounded, but there was little the townspeople could do. In those days, Glen Ellyn had no fire company of its own. A rider was dispatched to Wheaton two miles away, and the Wheaton Hook and Ladder Company responded as promptly as horses could pull the equipment. By the time they arrived, the fire was completely out of control. Furthermore, Glen Ellyn had no municipal water system to supply water for fighting the fire.\n\nThe fire started on the west side of Main Street, one building north of Crescent Boulevard. As was the case with the Great Chicago Fire, strong southerly winds pushed the fire north—toward Pennsylvania Avenue. Boyd Brothers Hardware Store was the next victim, followed by the office building of George M.H. Wagner, the drugstore of W.S. Ryder, the grocery store of John Mertz, and the W.H. Myers Meat Market. The fire burned all night until it had consumed every building on the west side of Main except for one just south of where the fire started.\n\nPractically everyone in town turned out to help, but their efforts were limited to removing merchandise and fixtures from the buildings in the path of the blaze and dousing sparks carried by the wind to businesses across the street. While the buildings on the east side of Main were spared destruction, several suffered blistered paint and charred wood.\n\nThe Glen Ellyn fire of 1891 didn’t make headlines around the country the way the Chicago fire had 20 years earlier, but proportionally it destroyed as large a portion of this community as the Chicago fire did for Chicago. And, like Chicago, Glen Ellyn immediately set about to replace the wood buildings in its central business district with masonry structures, many of which still stand today."
  },
  {
    "title": "Those Rowdy Boys From Danby Story",
    "date": "unknown",
    "type": "story",
    "source": "story/Those_Rowdy_Boys_from_Danby_story.md",
    "content": "Those Rowdy Boys from Danby\nThe First World War had a profound effect on British society, upsetting strict class distinctions and turning Victorian England on its ear. Curiously, the Civil War (1861–1865) had a similar effect on the little village of Glen Ellyn, which then was known as Danby.\n\nDanby sent 70 of its young men (more than 20 percent of its total population) off to fight in the Civil War. Most of them joined the 8th Illinois Cavalry, a regiment that saw action in several major Civil War battles. For many of them, it would have been the first time they had traveled more than 25 miles from home. They went off to war as boys; those who survived returned to Danby as men, wiser about the ways of the world. They had learned not only how to fight, but also how to drink, dance, and chase women. While not exactly admirable skills, they certainly were portable, and the young men traveled back home to Danby ready to show off their new abilities.\n\nBefore the war, Danby had been a sleepy farm town, a little shabby even. After the war, the reputation went from sleepy to rowdy. Barn dances in surrounding communities would be visited by the boys from Danby, who were known for drinking and flirting with girls. Soon they would be clearing the dance floor with their fists when boyfriends objected. During this period, deservedly or not, Danby became known for its saloons and houses of ill repute.\n\nIn his Reminiscences, Mr. Lawrence C. Cooper, a lawyer and town historian who commuted into Chicago on the train, tells the story of riding home one evening when he saw the conductor confront a very inebriated passenger. In an effort to collect the right fare, the conductor repeatedly asked the passenger where he was headed. The drunk finally replied, “I’m going to hell.” To which the conductor replied, “Then I’ll put you off at Danby. That’s about as close as we come.”\n\nIn an apparent effort to improve the image of the town, the village changed its post office designation to Prospect Park in 1874, and formally incorporated under that name in 1882. The town’s reputation began to improve after that, but it may not have had as much to do with the name change as with the aging of those rowdy boys from Danby."
  },
  {
    "title": "Wooden Sidewalks Hide Snaky Secrets Story",
    "date": "unknown",
    "type": "story",
    "source": "story/Wooden_Sidewalks_Hide_Snaky_Secrets_story.md",
    "content": "Wooden Sidewalks Hide Snaky Secrets\n\nLocal historian Ada Douglas Harmon once described the early wooden sidewalks in Glen Ellyn as a “…first-class rendezvous for snakes. When we walked along at night, the snakes would stick their heads up through the cracks and wiggle under our feet.”\n\nThe wooden sidewalks along Main Street in the downtown area were much higher than elsewhere in town—sometimes as much as three to four feet above street level—allowing shoppers to step directly to them from their horse-drawn carriages and high-wheeled buggies.\n\nUnfortunately, these sidewalks weren’t always kept in the best repair by the village. In 1893, a man from another town came to Glen Ellyn to transact some business. He fell through the sidewalk, broke his leg, and sued the village for $500. He won, and village officials were forced to pay—quite the joke at the time, as they were notorious for being cautious in money matters. It was reported that after this incident, the sidewalks were kept in better repair.\n\nClarence Curtis, grandson of Amos Churchill (one of the original settlers here), told the following story involving these high sidewalks:\n\n“One Sunday we were out for a ride when a heavy rain came up. Grandpa Churchill had a lumber business on Crescent just west of Main Street. We stopped in his barn, waiting for the rain to stop. Northeast of the barn was the William Wagner store facing on Main. The wooden sidewalk in front of the store was level with the entrance and was set on posts several feet high.\n\nMy dad noticed some boys going under the walk in front of the store, so he sent for Uncle Joe Clark [the town constable]. Dad knew there had been thefts from the store. Mr. Wagner and Uncle Joe and my dad went into the store. They found one boy hiding under a counter. Mother and I saw another boy come out and run away. I knew who he was, and when he was caught he confessed. There were quite a few boys involved. They had a cave in Honeysuckle Hill, where they were taking their loot and having a good time.”\n\nToday, the building that housed the William Wagner Grocery Store on Main is long gone, while Glenbard West High School sits atop Honeysuckle Hill. Concrete sidewalks replaced the wooden ones in 1906."
  }
]